Requests/CadastrarAtualizarTransportador.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tms="http://tmsfrete.v2.targetmp.com.br"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <tms:CadastrarAtualizarTransportador>
            <tms:auth>
                <tms:Usuario>setransportes.tms</tms:Usuario>
                <tms:Senha>Se@08289</tms:Senha>
                <tms:Token></tms:Token>
            </tms:auth>
            <tms:transportador>
                <tms:Instrucao>1</tms:Instrucao>
                <tms:RNTRC>11952027</tms:RNTRC>
                <tms:CPFCNPJ>03235544666</tms:CPFCNPJ>
                <tms:Nome>ALEX TRINDADE</tms:Nome>
                <tms:Sobrenome>TRINDADE</tms:Sobrenome>
                <tms:RazaoSocial>ALEX TRINDADE</tms:RazaoSocial>
                <tms:DataNascimento>1980-02-02</tms:DataNascimento>
                <tms:RG>0323333333</tms:RG>
                <tms:OrgaoEmissorRg></tms:OrgaoEmissorRg>
                <tms:CNH></tms:CNH>
                <tms:TipoCNH></tms:TipoCNH>
                <tms:DataValidadeCNH i:nil="true"/>
                <tms:Sexo>M</tms:Sexo>
                <tms:Naturalidade>0</tms:Naturalidade>
                <tms:Nacionalidade>0</tms:Nacionalidade>
                <tms:InscricaoEstadual>0323333333</tms:InscricaoEstadual>
                <tms:InscricaoMunicipal></tms:InscricaoMunicipal>
                <tms:NomeFantasia>ALEX TRINDADE</tms:NomeFantasia>
                <tms:DataInscricao>2020-08-27</tms:DataInscricao>
                <tms:IdDmAtividadeEconomica>0</tms:IdDmAtividadeEconomica>
                <tms:Endereco>VIA PRINCIPAL</tms:Endereco>
                <tms:NumeroEndereco>2</tms:NumeroEndereco>
                <tms:EnderecoComplemento></tms:EnderecoComplemento>
                <tms:Bairro>ALTO DA BELA VISTA</tms:Bairro>
                <tms:CEP>75580000</tms:CEP>
                <tms:CodigoIBGEMunicipio>5216007</tms:CodigoIBGEMunicipio>
                <tms:IdentificadorEndereco>75580000</tms:IdentificadorEndereco>
                <tms:TelefoneFixo>5050505050</tms:TelefoneFixo>
                <tms:TelefoneCelular>5050505050</tms:TelefoneCelular>
                <tms:EstadoCivil>0</tms:EstadoCivil>
                <tms:Email></tms:Email>
                <tms:Usuario>03235544666</tms:Usuario>
                <tms:CodigoBanco>756</tms:CodigoBanco>
                <tms:CodigoAgencia>3141</tms:CodigoAgencia>
                <tms:DigitoAgencia>0</tms:DigitoAgencia>
                <tms:ContaCorrente>27286</tms:ContaCorrente>
                <tms:DigitoContaCorrente></tms:DigitoContaCorrente>
                <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                <tms:VariacaoContaPoupanca></tms:VariacaoContaPoupanca>
                <tms:NomeContato></tms:NomeContato>
                <tms:CargoContato></tms:CargoContato>
                <tms:CPFCNPJContato></tms:CPFCNPJContato>
                <tms:TelefoneFixoContato>0</tms:TelefoneFixoContato>
                <tms:TelefoneCelularContato>0</tms:TelefoneCelularContato>
                <tms:EmailContato></tms:EmailContato>
                <tms:DataNascimentoContato>1900-01-01</tms:DataNascimentoContato>
                <tms:RGContato></tms:RGContato>
                <tms:OrgaoEmissorRgContato></tms:OrgaoEmissorRgContato>
            </tms:transportador>
        </tms:CadastrarAtualizarTransportador>
    </soapenv:Body>
</soapenv:Envelope>
